barsgl/barsgl-ejbparent/barsgl-ejbtest/src/test/resources/AccountDetailsNotifyFcc6Shadow.xml

<NS1:Envelope xmlns:NS1="http://schemas.xmlsoap.org/soap/envelope/">
    <NS1:Header>
        <NS2:UCBRUHeaders xmlns:NS2="urn:imb:gbo:v2">
            <NS2:Audit>
                <NS2:MessagePath>
                    <NS2:Step>
                        <NS2:Application.Module>SRVACC.AccountDetailsNotify.NotificationHandler</NS2:Application.Module>
                        <NS2:VersionId>v4</NS2:VersionId>
                        <NS2:TimeStamp>2016-06-24T13:35:33.540+03:00</NS2:TimeStamp>
                        <NS2:RoutingRole>START</NS2:RoutingRole>
                        <NS2:Comment/>
                    </NS2:Step>
                    <NS2:Step>
                        <NS2:Application.Module>SRVACC.AccountListQuery</NS2:Application.Module>
                        <NS2:VersionId>v2</NS2:VersionId>
                        <NS2:TimeStamp>2016-06-24T13:35:33.550+03:00</NS2:TimeStamp>
                        <NS2:RoutingRole>START</NS2:RoutingRole>
                        <NS2:Comment/>
                    </NS2:Step>
                    <NS2:Step>
                        <NS2:Application.Module>SRVACC.AccountListQuery</NS2:Application.Module>
                        <NS2:VersionId>v2</NS2:VersionId>
                        <NS2:TimeStamp>2016-06-24T13:35:33.771+03:00</NS2:TimeStamp>
                        <NS2:RoutingRole>SUCCESS</NS2:RoutingRole>
                        <NS2:Comment/>
                    </NS2:Step>
                    <NS2:Step>
                        <NS2:Application.Module>SRVACC.AccountDetailsNotify.Publisher</NS2:Application.Module>
                        <NS2:VersionId>v2</NS2:VersionId>
                        <NS2:TimeStamp>2016-06-24T13:35:33.789+03:00</NS2:TimeStamp>
                        <NS2:RoutingRole>SUCCESS</NS2:RoutingRole>
                        <NS2:Comment></NS2:Comment>
                    </NS2:Step>
                </NS2:MessagePath>
            </NS2:Audit>
        </NS2:UCBRUHeaders>
    </NS1:Header>
    <NS1:Body>
        <gbo:AccountList xmlns:gbo="urn:imb:gbo:v2">
            <gbo:AccountDetails>
                <gbo:AccountNo>770078RUR400902024</gbo:AccountNo>
                <gbo:Branch>024</gbo:Branch>
                <gbo:CBAccountNo>40802810900014879108</gbo:CBAccountNo>
                <gbo:Ccy>RUR</gbo:Ccy>
                <gbo:CcyDigital>810</gbo:CcyDigital>
                <gbo:Description>SANNIKOVA NATALYA</gbo:Description>
                <gbo:Status>O</gbo:Status>
                <gbo:CustomerNo>00770078</gbo:CustomerNo>
                <gbo:Special>4009</gbo:Special>
                <gbo:OpenDate>2016-06-24</gbo:OpenDate>
                <gbo:CreditTransAllowed>Y</gbo:CreditTransAllowed>
                <gbo:DebitTransAllowed>Y</gbo:DebitTransAllowed>
                <gbo:CorBank>044525545</gbo:CorBank>
                <gbo:CorINN>772446207507</gbo:CorINN>
                <gbo:Positioning>
                    <gbo:CBAccount>40802810900014879108</gbo:CBAccount>
                    <gbo:IMBAccountNo>40802810900014879108</gbo:IMBAccountNo>
                    <gbo:IMBBranch>024</gbo:IMBBranch>
                    <gbo:HostABSAccountNo>770078RUR400902024</gbo:HostABSAccountNo>
                    <gbo:HostABSBranch>024</gbo:HostABSBranch>
                    <gbo:HostABS>FCC</gbo:HostABS>
                </gbo:Positioning>
                <gbo:UDF>
                    <gbo:Name>GWSAccType</gbo:Name>
                    <gbo:Value>CURR</gbo:Value>
                </gbo:UDF>
                <gbo:UDF>
                    <gbo:Name>OperationTypeCodes</gbo:Name>
                    <gbo:Value>
                        VIEW=1,DOMPAY=1,DOMTAX=1,DOMCUS=1,CUPADE=1,CUPACO=1,CUSEOD=1,CUSEOC=1,CURBUY=1,CUOPCE=1,
                    </gbo:Value>
                </gbo:UDF>
                <gbo:UDF>
                    <gbo:Name>ParentBranchName</gbo:Name>
                    <gbo:Value>UCB, Moscow</gbo:Value>
                </gbo:UDF>
                <gbo:UDF>
                    <gbo:Name>CusSegment</gbo:Name>
                    <gbo:Value>TIER_I</gbo:Value>
                </gbo:UDF>
                <gbo:ShadowAccounts>
                    <gbo:HostABS>FCC</gbo:HostABS>
                    <gbo:AccountNo>00770078RURENSA101</gbo:AccountNo>
                    <gbo:Branch>A12</gbo:Branch>
                </gbo:ShadowAccounts>
            </gbo:AccountDetails>
        </gbo:AccountList>
    </NS1:Body>
</NS1:Envelope>
